[
    {
        "ratings": {
            "5 star": "53%",
            "4 star": "19%",
            "3 star": "6%",
            "2 star": "4%",
            "1 star": "18%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Have been a Goqii \"Player\" off and on literally since the beginning. This is by far the best band to come out of their stables ! The colour screen is a welcome addition and the swiping just makes it a lot easier to use. Heart rate and step counts are bang on , probable more accurate than previous versions . The two concerns are the BP is inaccurate and there are some other minor issues. Goqii has assured these issues are software based and will be corrected soon. Once that happens, easily worth 5*",
                "review_posted_date": "07 Aug 2018",
                "review_header": "Great addition to a solid concept !!",
                "review_rating": "4.0 ",
                "review_author": "Trucit Vora"
            },
            {
                "review_comment_count": "",
                "review_text": "When I searched for perfect Fitness activity tracker through online research and with reviews, I found GOQii came up with L1 both in Price and Technical. But immediately after purchase what was impressed me a lot is their Coaching facility to encourage you to get FIT with proper guidance and Doctor on call which will make you definitely to get fit with some target. I appreciate the whole GOQii team for their initiative to make India better with Fitness... Go for it guys instead of paying to Hospitals...",
                "review_posted_date": "22 Aug 2018",
                "review_header": "Vital - An fantastic Fitness Gadget which makes you get FIT",
                "review_rating": "4.0 ",
                "review_author": "P THANGAVELU"
            },
            {
                "review_comment_count": "",
                "review_text": "Amazing product, Helps You to stay Fit, Eat Healthy& achieve Your target Goals!",
                "review_posted_date": "21 Jul 2018",
                "review_header": "Awesome Product to promote awareness of Good Health",
                "review_rating": "5.0 ",
                "review_author": "Sush"
            },
            {
                "review_comment_count": "",
                "review_text": "I like the design efficiency, but still the company has to improve customer care support when ever they say they'll mail regarding the complaint they don't send mails!. Am using the new vital band the step count is counted even driving or travelling in bus since I travel four hours a day nearly 5000 to 6000 steps is getting counted daily which is very bad!!! Regarding the app also it is still not clear. Not friendly, only i can see they are promoting many food items.which i don't need!!!",
                "review_posted_date": "22 Aug 2018",
                "review_header": "Know what we need!",
                "review_rating": "4.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "I had bought original GOqii around two year back and it stopped working since it fell in water. Since then was thinking of buying a new one. Got surprised to see upgraded version of the band and bought it on prime day. To my surprise band is water proof and has several functions including heart rate, blood pressure, bluetooth notifications etc., Further got 3 month health coach subscription. The band is working well since then.",
                "review_posted_date": "26 Aug 2018",
                "review_header": "Great successor to the orginal band",
                "review_rating": "5.0 ",
                "review_author": "sudheer"
            },
            {
                "review_comment_count": "",
                "review_text": "Good product with a week's battery life. First time it went on for 2 days but from next charge onwards giving almost a week's worth . Coach are great and keep track of your performance and give suggestions as well to improve your health and fitness",
                "review_posted_date": "01 Sep 2018",
                "review_header": "1 week battery life, good product.",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought GOQii for its unique feature, i.e., BP measurement on the go. Its definitely a cool gadget. It tracks your foot steps, exercise details, heart rate as well. Its app logs all your measurements. The best part of GOQii is a very personalized training plan through experienced and certified coaches. They are wonderful and help us identify our health goals and guide us to achieve them through routine chats, coach calls, etc. They also provide us with wonderful information on the food that has to be consumed for achieving our health goals, exercise that needs to be carried out, alternate food recipes to loose fat, etc. Overall, personalized coaching is a big USP for GOQii. Another wonderful part of GOQii is its app. It includes live videos by certified coaches and experts, health assessment reports (which can be shared with doctors for their opinion), etc. You get tons of reports on weight management, yoga, nutrition, etc. Overall, this product is a must in case you want to manage weight. Take this product with a 3 months training plan and you wont regret it.",
                "review_posted_date": "28 Aug 2018",
                "review_header": "Neat display, personalized training and professional coaches",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Excellent product!! Very Good band for a starter!! Coaching tips are amazing the Coach keeps you continuously motivating and keep the status updated about ur Goals!!",
                "review_posted_date": "14 Aug 2018",
                "review_header": "Awesome Product!!!",
                "review_rating": "5.0 ",
                "review_author": "Vikram"
            }
        ],
        "url": "http://www.amazon.in/gp/product/B07DRQ6FBG",
        "price": " 3499.00",
        "name": "GOQii Vital - Colour Display Blood Pressure Monitor with 3 Months Personal Coaching, Adult (Black)"
    }
]